Revit 2024 API
PipeScheduleType.Create Method
 Creates a new pipe schedule type with the given name.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static PipeScheduleType Create(
	Document doc,
	string name
)
Visual Basic
Public Shared Function Create ( _
	doc As Document, _
	name As String _
) As PipeScheduleType
Visual C++
public:
static PipeScheduleType^ Create(
	Document^ doc,
	String^ name
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document
name
Type: System.String
 The name of requested schedule type.
Return Value
 Returns the newly created schedule type.
Remarks
 If the name is already taken by an existing schedule type, an InvalidOperationException will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name is an empty string.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  The name is already taken by an existing pipe schedule type.
See Also
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace